name: "SiameseNetwork"

# Read data for the left part of the Siamese Network:
layer {
  name: "data_left"
  type: "Data"
  top: "data_left"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    scale: 0.00390625
  }
  data_param {
    source: "/home/jedrzej/siamese_data/siamese_train_left_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "data_left"
  type: "Data"
  top: "data_left"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    scale: 0.00390625
  }
  data_param {
    source: "/home/jedrzej/siamese_data/siamese_val_left_lmdb"
    batch_size: 25
    backend: LMDB
  }
}

# Read data for the right part of the Siamese Network:
layer {
  name: "data_right"
  type: "Data"
  top: "data_right"
  top: "label_other"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    scale: 0.00390625
  }
  data_param {
    source: "/home/jedrzej/siamese_data/siamese_train_right_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "data_right"
  type: "Data"
  top: "data_right"
  top: "label_other"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    scale: 0.00390625
  }
  data_param {
    source: "/home/jedrzej/siamese_data/siamese_val_right_lmdb"
    batch_size: 25
    backend: LMDB
  }
}

layer {
  name: "silence_layer"
  type: "Silence"
  bottom: "label_other"
}

#####################################################################################################
# Build the left part of the Siamese Network:
layer {
  name: "conv1/7x7_s2_left"
  type: "Convolution"
  bottom: "data_left"
  top: "conv1/7x7_s2_left"
  param {
    name: "conv1/7x7_s2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1/7x7_s2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1/relu_7x7_left"
  type: "ReLU"
  bottom: "conv1/7x7_s2_left"
  top: "conv1/7x7_s2_left"
}
layer {
  name: "pool1/3x3_s2_left"
  type: "Pooling"
  bottom: "conv1/7x7_s2_left"
  top: "pool1/3x3_s2_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1/norm1_left"
  type: "LRN"
  bottom: "pool1/3x3_s2_left"
  top: "pool1/norm1_left"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2/3x3_reduce_left"
  type: "Convolution"
  bottom: "pool1/norm1_left"
  top: "conv2/3x3_reduce_left"
  param {
    name: "conv2/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "conv2/3x3_reduce_left"
  top: "conv2/3x3_reduce_left"
}
layer {
  name: "conv2/3x3_left"
  type: "Convolution"
  bottom: "conv2/3x3_reduce_left"
  top: "conv2/3x3_left"
  param {
    name: "conv2/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_left"
  type: "ReLU"
  bottom: "conv2/3x3_left"
  top: "conv2/3x3_left"
}
layer {
  name: "conv2/norm2_left"
  type: "LRN"
  bottom: "conv2/3x3_left"
  top: "conv2/norm2_left"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2/3x3_s2_left"
  type: "Pooling"
  bottom: "conv2/norm2_left"
  top: "pool2/3x3_s2_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a/1x1_left"
  type: "Convolution"
  bottom: "pool2/3x3_s2_left"
  top: "inception_3a/1x1_left"
  param {
    name: "inception_3a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_3a/1x1_left"
  top: "inception_3a/1x1_left"
}
layer {
  name: "inception_3a/3x3_reduce_left"
  type: "Convolution"
  bottom: "pool2/3x3_s2_left"
  top: "inception_3a/3x3_reduce_left"
  param {
    name: "inception_3a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce_left"
  top: "inception_3a/3x3_reduce_left"
}
layer {
  name: "inception_3a/3x3_left"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_left"
  top: "inception_3a/3x3_left"
  param {
    name: "inception_3a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_3a/3x3_left"
  top: "inception_3a/3x3_left"
}
layer {
  name: "inception_3a/5x5_reduce_left"
  type: "Convolution"
  bottom: "pool2/3x3_s2_left"
  top: "inception_3a/5x5_reduce_left"
  param {
    name: "inception_3a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce_left"
  top: "inception_3a/5x5_reduce_left"
}
layer {
  name: "inception_3a/5x5_left"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce_left"
  top: "inception_3a/5x5_left"
  param {
    name: "inception_3a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_3a/5x5_left"
  top: "inception_3a/5x5_left"
}
layer {
  name: "inception_3a/pool_left"
  type: "Pooling"
  bottom: "pool2/3x3_s2_left"
  top: "inception_3a/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj_left"
  type: "Convolution"
  bottom: "inception_3a/pool_left"
  top: "inception_3a/pool_proj_left"
  param {
    name: "inception_3a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_3a/pool_proj_left"
  top: "inception_3a/pool_proj_left"
}
layer {
  name: "inception_3a/output_left"
  type: "Concat"
  bottom: "inception_3a/1x1_left"
  bottom: "inception_3a/3x3_left"
  bottom: "inception_3a/5x5_left"
  bottom: "inception_3a/pool_proj_left"
  top: "inception_3a/output_left"
}
layer {
  name: "inception_3b/1x1_left"
  type: "Convolution"
  bottom: "inception_3a/output_left"
  top: "inception_3b/1x1_left"
  param {
    name: "inception_3b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_3b/1x1_left"
  top: "inception_3b/1x1_left"
}
layer {
  name: "inception_3b/3x3_reduce_left"
  type: "Convolution"
  bottom: "inception_3a/output_left"
  top: "inception_3b/3x3_reduce_left"
  param {
    name: "inception_3b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce_left"
  top: "inception_3b/3x3_reduce_left"
}
layer {
  name: "inception_3b/3x3_left"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce_left"
  top: "inception_3b/3x3_left"
  param {
    name: "inception_3b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_3b/3x3_left"
  top: "inception_3b/3x3_left"
}
layer {
  name: "inception_3b/5x5_reduce_left"
  type: "Convolution"
  bottom: "inception_3a/output_left"
  top: "inception_3b/5x5_reduce_left"
  param {
    name: "inception_3b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_3b/5x5_reduce_left"
  top: "inception_3b/5x5_reduce_left"
}
layer {
  name: "inception_3b/5x5_left"
  type: "Convolution"
  bottom: "inception_3b/5x5_reduce_left"
  top: "inception_3b/5x5_left"
  param {
    name: "inception_3b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_3b/5x5_left"
  top: "inception_3b/5x5_left"
}
layer {
  name: "inception_3b/pool_left"
  type: "Pooling"
  bottom: "inception_3a/output_left"
  top: "inception_3b/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b/pool_proj_left"
  type: "Convolution"
  bottom: "inception_3b/pool_left"
  top: "inception_3b/pool_proj_left"
  param {
    name: "inception_3b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_3b/pool_proj_left"
  top: "inception_3b/pool_proj_left"
}
layer {
  name: "inception_3b/output_left"
  type: "Concat"
  bottom: "inception_3b/1x1_left"
  bottom: "inception_3b/3x3_left"
  bottom: "inception_3b/5x5_left"
  bottom: "inception_3b/pool_proj_left"
  top: "inception_3b/output_left"
}
layer {
  name: "pool3/3x3_s2_left"
  type: "Pooling"
  bottom: "inception_3b/output_left"
  top: "pool3/3x3_s2_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_4a/1x1_left"
  type: "Convolution"
  bottom: "pool3/3x3_s2_left"
  top: "inception_4a/1x1_left"
  param {
    name: "inception_4a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_4a/1x1_left"
  top: "inception_4a/1x1_left"
}
layer {
  name: "inception_4a/3x3_reduce_left"
  type: "Convolution"
  bottom: "pool3/3x3_s2_left"
  top: "inception_4a/3x3_reduce_left"
  param {
    name: "inception_4a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_4a/3x3_reduce_left"
  top: "inception_4a/3x3_reduce_left"
}
layer {
  name: "inception_4a/3x3_left"
  type: "Convolution"
  bottom: "inception_4a/3x3_reduce_left"
  top: "inception_4a/3x3_left"
  param {
    name: "inception_4a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_4a/3x3_left"
  top: "inception_4a/3x3_left"
}
layer {
  name: "inception_4a/5x5_reduce_left"
  type: "Convolution"
  bottom: "pool3/3x3_s2_left"
  top: "inception_4a/5x5_reduce_left"
  param {
    name: "inception_4a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_4a/5x5_reduce_left"
  top: "inception_4a/5x5_reduce_left"
}
layer {
  name: "inception_4a/5x5_left"
  type: "Convolution"
  bottom: "inception_4a/5x5_reduce_left"
  top: "inception_4a/5x5_left"
  param {
    name: "inception_4a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_4a/5x5_left"
  top: "inception_4a/5x5_left"
}
layer {
  name: "inception_4a/pool_left"
  type: "Pooling"
  bottom: "pool3/3x3_s2_left"
  top: "inception_4a/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a/pool_proj_left"
  type: "Convolution"
  bottom: "inception_4a/pool_left"
  top: "inception_4a/pool_proj_left"
  param {
    name: "inception_4a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_4a/pool_proj_left"
  top: "inception_4a/pool_proj_left"
}
layer {
  name: "inception_4a/output_left"
  type: "Concat"
  bottom: "inception_4a/1x1_left"
  bottom: "inception_4a/3x3_left"
  bottom: "inception_4a/5x5_left"
  bottom: "inception_4a/pool_proj_left"
  top: "inception_4a/output_left"
}
layer {
  name: "loss1/ave_pool_left"
  type: "Pooling"
  bottom: "inception_4a/output_left"
  top: "loss1/ave_pool_left"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "loss1/conv_left"
  type: "Convolution"
  bottom: "loss1/ave_pool_left"
  top: "loss1/conv_left"
  param {
    name: "loss1/conv_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss1/conv_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss1/relu_conv_left"
  type: "ReLU"
  bottom: "loss1/conv_left"
  top: "loss1/conv_left"
}
layer {
  name: "loss1/fc_left"
  type: "InnerProduct"
  bottom: "loss1/conv_left"
  top: "loss1/fc_left"
  param {
    name: "loss1/fc_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss1/fc_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
  name: "inception_4b/1x1_left"
  type: "Convolution"
  bottom: "inception_4a/output_left"
  top: "inception_4b/1x1_left"
  param {
    name: "inception_4b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_4b/1x1_left"
  top: "inception_4b/1x1_left"
}
layer {
  name: "inception_4b/3x3_reduce_left"
  type: "Convolution"
  bottom: "inception_4a/output_left"
  top: "inception_4b/3x3_reduce_left"
  param {
    name: "inception_4b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_4b/3x3_reduce_left"
  top: "inception_4b/3x3_reduce_left"
}
layer {
  name: "inception_4b/3x3_left"
  type: "Convolution"
  bottom: "inception_4b/3x3_reduce_left"
  top: "inception_4b/3x3_left"
  param {
    name: "inception_4b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_4b/3x3_left"
  top: "inception_4b/3x3_left"
}
layer {
  name: "inception_4b/5x5_reduce_left"
  type: "Convolution"
  bottom: "inception_4a/output_left"
  top: "inception_4b/5x5_reduce_left"
  param {
    name: "inception_4b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_4b/5x5_reduce_left"
  top: "inception_4b/5x5_reduce_left"
}
layer {
  name: "inception_4b/5x5_left"
  type: "Convolution"
  bottom: "inception_4b/5x5_reduce_left"
  top: "inception_4b/5x5_left"
  param {
    name: "inception_4b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_4b/5x5_left"
  top: "inception_4b/5x5_left"
}
layer {
  name: "inception_4b/pool_left"
  type: "Pooling"
  bottom: "inception_4a/output_left"
  top: "inception_4b/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4b/pool_proj_left"
  type: "Convolution"
  bottom: "inception_4b/pool_left"
  top: "inception_4b/pool_proj_left"
  param {
    name: "inception_4b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_4b/pool_proj_left"
  top: "inception_4b/pool_proj_left"
}
layer {
  name: "inception_4b/output_left"
  type: "Concat"
  bottom: "inception_4b/1x1_left"
  bottom: "inception_4b/3x3_left"
  bottom: "inception_4b/5x5_left"
  bottom: "inception_4b/pool_proj_left"
  top: "inception_4b/output_left"
}
layer {
  name: "inception_4c/1x1_left"
  type: "Convolution"
  bottom: "inception_4b/output_left"
  top: "inception_4c/1x1_left"
  param {
    name: "inception_4c/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_4c/1x1_left"
  top: "inception_4c/1x1_left"
}
layer {
  name: "inception_4c/3x3_reduce_left"
  type: "Convolution"
  bottom: "inception_4b/output_left"
  top: "inception_4c/3x3_reduce_left"
  param {
    name: "inception_4c/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_4c/3x3_reduce_left"
  top: "inception_4c/3x3_reduce_left"
}
layer {
  name: "inception_4c/3x3_left"
  type: "Convolution"
  bottom: "inception_4c/3x3_reduce_left"
  top: "inception_4c/3x3_left"
  param {
    name: "inception_4c/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_4c/3x3_left"
  top: "inception_4c/3x3_left"
}
layer {
  name: "inception_4c/5x5_reduce_left"
  type: "Convolution"
  bottom: "inception_4b/output_left"
  top: "inception_4c/5x5_reduce_left"
  param {
    name: "inception_4c/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_4c/5x5_reduce_left"
  top: "inception_4c/5x5_reduce_left"
}
layer {
  name: "inception_4c/5x5_left"
  type: "Convolution"
  bottom: "inception_4c/5x5_reduce_left"
  top: "inception_4c/5x5_left"
  param {
    name: "inception_4c/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_4c/5x5_left"
  top: "inception_4c/5x5_left"
}
layer {
  name: "inception_4c/pool_left"
  type: "Pooling"
  bottom: "inception_4b/output_left"
  top: "inception_4c/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4c/pool_proj_left"
  type: "Convolution"
  bottom: "inception_4c/pool_left"
  top: "inception_4c/pool_proj_left"
  param {
    name: "inception_4c/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_4c/pool_proj_left"
  top: "inception_4c/pool_proj_left"
}
layer {
  name: "inception_4c/output_left"
  type: "Concat"
  bottom: "inception_4c/1x1_left"
  bottom: "inception_4c/3x3_left"
  bottom: "inception_4c/5x5_left"
  bottom: "inception_4c/pool_proj_left"
  top: "inception_4c/output_left"
}
layer {
  name: "inception_4d/1x1_left"
  type: "Convolution"
  bottom: "inception_4c/output_left"
  top: "inception_4d/1x1_left"
  param {
    name: "inception_4d/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_4d/1x1_left"
  top: "inception_4d/1x1_left"
}
layer {
  name: "inception_4d/3x3_reduce_left"
  type: "Convolution"
  bottom: "inception_4c/output_left"
  top: "inception_4d/3x3_reduce_left"
  param {
    name: "inception_4d/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 144
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_4d/3x3_reduce_left"
  top: "inception_4d/3x3_reduce_left"
}
layer {
  name: "inception_4d/3x3_left"
  type: "Convolution"
  bottom: "inception_4d/3x3_reduce_left"
  top: "inception_4d/3x3_left"
  param {
    name: "inception_4d/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 288
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_4d/3x3_left"
  top: "inception_4d/3x3_left"
}
layer {
  name: "inception_4d/5x5_reduce_left"
  type: "Convolution"
  bottom: "inception_4c/output_left"
  top: "inception_4d/5x5_reduce_left"
  param {
    name: "inception_4d/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_4d/5x5_reduce_left"
  top: "inception_4d/5x5_reduce_left"
}
layer {
  name: "inception_4d/5x5_left"
  type: "Convolution"
  bottom: "inception_4d/5x5_reduce_left"
  top: "inception_4d/5x5_left"
  param {
    name: "inception_4d/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_4d/5x5_left"
  top: "inception_4d/5x5_left"
}
layer {
  name: "inception_4d/pool_left"
  type: "Pooling"
  bottom: "inception_4c/output_left"
  top: "inception_4d/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4d/pool_proj_left"
  type: "Convolution"
  bottom: "inception_4d/pool_left"
  top: "inception_4d/pool_proj_left"
  param {
    name: "inception_4d/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_4d/pool_proj_left"
  top: "inception_4d/pool_proj_left"
}
layer {
  name: "inception_4d/output_left"
  type: "Concat"
  bottom: "inception_4d/1x1_left"
  bottom: "inception_4d/3x3_left"
  bottom: "inception_4d/5x5_left"
  bottom: "inception_4d/pool_proj_left"
  top: "inception_4d/output_left"
}
layer {
  name: "loss2/ave_pool_left"
  type: "Pooling"
  bottom: "inception_4d/output_left"
  top: "loss2/ave_pool_left"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "loss2/conv_left"
  type: "Convolution"
  bottom: "loss2/ave_pool_left"
  top: "loss2/conv_left"
  param {
    name: "loss2/conv_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss2/conv_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "loss2/relu_conv_left"
  type: "ReLU"
  bottom: "loss2/conv_left"
  top: "loss2/conv_left"
}
layer {
  name: "loss2/fc_left"
  type: "InnerProduct"
  bottom: "loss2/conv_left"
  top: "loss2/fc_left"
  param {
    name: "loss2/fc_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "loss2/fc_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}


layer {
  name: "inception_4e/1x1_left"
  type: "Convolution"
  bottom: "inception_4d/output_left"
  top: "inception_4e/1x1_left"
  param {
    name: "inception_4e/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_4e/1x1_left"
  top: "inception_4e/1x1_left"
}
layer {
  name: "inception_4e/3x3_reduce_left"
  type: "Convolution"
  bottom: "inception_4d/output_left"
  top: "inception_4e/3x3_reduce_left"
  param {
    name: "inception_4e/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_4e/3x3_reduce_left"
  top: "inception_4e/3x3_reduce_left"
}
layer {
  name: "inception_4e/3x3_left"
  type: "Convolution"
  bottom: "inception_4e/3x3_reduce_left"
  top: "inception_4e/3x3_left"
  param {
    name: "inception_4e/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_4e/3x3_left"
  top: "inception_4e/3x3_left"
}
layer {
  name: "inception_4e/5x5_reduce_left"
  type: "Convolution"
  bottom: "inception_4d/output_left"
  top: "inception_4e/5x5_reduce_left"
  param {
    name: "inception_4e/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_4e/5x5_reduce_left"
  top: "inception_4e/5x5_reduce_left"
}
layer {
  name: "inception_4e/5x5_left"
  type: "Convolution"
  bottom: "inception_4e/5x5_reduce_left"
  top: "inception_4e/5x5_left"
  param {
    name: "inception_4e/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_4e/5x5_left"
  top: "inception_4e/5x5_left"
}
layer {
  name: "inception_4e/pool_left"
  type: "Pooling"
  bottom: "inception_4d/output_left"
  top: "inception_4e/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4e/pool_proj_left"
  type: "Convolution"
  bottom: "inception_4e/pool_left"
  top: "inception_4e/pool_proj_left"
  param {
    name: "inception_4e/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_4e/pool_proj_left"
  top: "inception_4e/pool_proj_left"
}
layer {
  name: "inception_4e/output_left"
  type: "Concat"
  bottom: "inception_4e/1x1_left"
  bottom: "inception_4e/3x3_left"
  bottom: "inception_4e/5x5_left"
  bottom: "inception_4e/pool_proj_left"
  top: "inception_4e/output_left"
}
layer {
  name: "pool4/3x3_s2_left"
  type: "Pooling"
  bottom: "inception_4e/output_left"
  top: "pool4/3x3_s2_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_5a/1x1_left"
  type: "Convolution"
  bottom: "pool4/3x3_s2_left"
  top: "inception_5a/1x1_left"
  param {
    name: "inception_5a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_5a/1x1_left"
  top: "inception_5a/1x1_left"
}
layer {
  name: "inception_5a/3x3_reduce_left"
  type: "Convolution"
  bottom: "pool4/3x3_s2_left"
  top: "inception_5a/3x3_reduce_left"
  param {
    name: "inception_5a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_5a/3x3_reduce_left"
  top: "inception_5a/3x3_reduce_left"
}
layer {
  name: "inception_5a/3x3_left"
  type: "Convolution"
  bottom: "inception_5a/3x3_reduce_left"
  top: "inception_5a/3x3_left"
  param {
    name: "inception_5a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_5a/3x3_left"
  top: "inception_5a/3x3_left"
}
layer {
  name: "inception_5a/5x5_reduce_left"
  type: "Convolution"
  bottom: "pool4/3x3_s2_left"
  top: "inception_5a/5x5_reduce_left"
  param {
    name: "inception_5a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_5a/5x5_reduce_left"
  top: "inception_5a/5x5_reduce_left"
}
layer {
  name: "inception_5a/5x5_left"
  type: "Convolution"
  bottom: "inception_5a/5x5_reduce_left"
  top: "inception_5a/5x5_left"
  param {
    name: "inception_5a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_5a/5x5_left"
  top: "inception_5a/5x5_left"
}
layer {
  name: "inception_5a/pool_left"
  type: "Pooling"
  bottom: "pool4/3x3_s2_left"
  top: "inception_5a/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5a/pool_proj_left"
  type: "Convolution"
  bottom: "inception_5a/pool_left"
  top: "inception_5a/pool_proj_left"
  param {
    name: "inception_5a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_5a/pool_proj_left"
  top: "inception_5a/pool_proj_left"
}
layer {
  name: "inception_5a/output_left"
  type: "Concat"
  bottom: "inception_5a/1x1_left"
  bottom: "inception_5a/3x3_left"
  bottom: "inception_5a/5x5_left"
  bottom: "inception_5a/pool_proj_left"
  top: "inception_5a/output_left"
}
layer {
  name: "inception_5b/1x1_left"
  type: "Convolution"
  bottom: "inception_5a/output_left"
  top: "inception_5b/1x1_left"
  param {
    name: "inception_5b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_1x1_left"
  type: "ReLU"
  bottom: "inception_5b/1x1_left"
  top: "inception_5b/1x1_left"
}
layer {
  name: "inception_5b/3x3_reduce_left"
  type: "Convolution"
  bottom: "inception_5a/output_left"
  top: "inception_5b/3x3_reduce_left"
  param {
    name: "inception_5b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3_reduce_left"
  type: "ReLU"
  bottom: "inception_5b/3x3_reduce_left"
  top: "inception_5b/3x3_reduce_left"
}
layer {
  name: "inception_5b/3x3_left"
  type: "Convolution"
  bottom: "inception_5b/3x3_reduce_left"
  top: "inception_5b/3x3_left"
  param {
    name: "inception_5b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3_left"
  type: "ReLU"
  bottom: "inception_5b/3x3_left"
  top: "inception_5b/3x3_left"
}
layer {
  name: "inception_5b/5x5_reduce_left"
  type: "Convolution"
  bottom: "inception_5a/output_left"
  top: "inception_5b/5x5_reduce_left"
  param {
    name: "inception_5b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5_reduce_left"
  type: "ReLU"
  bottom: "inception_5b/5x5_reduce_left"
  top: "inception_5b/5x5_reduce_left"
}
layer {
  name: "inception_5b/5x5_left"
  type: "Convolution"
  bottom: "inception_5b/5x5_reduce_left"
  top: "inception_5b/5x5_left"
  param {
    name: "inception_5b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5_left"
  type: "ReLU"
  bottom: "inception_5b/5x5_left"
  top: "inception_5b/5x5_left"
}
layer {
  name: "inception_5b/pool_left"
  type: "Pooling"
  bottom: "inception_5a/output_left"
  top: "inception_5b/pool_left"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5b/pool_proj_left"
  type: "Convolution"
  bottom: "inception_5b/pool_left"
  top: "inception_5b/pool_proj_left"
  param {
    name: "inception_5b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_pool_proj_left"
  type: "ReLU"
  bottom: "inception_5b/pool_proj_left"
  top: "inception_5b/pool_proj_left"
}
layer {
  name: "inception_5b/output_left"
  type: "Concat"
  bottom: "inception_5b/1x1_left"
  bottom: "inception_5b/3x3_left"
  bottom: "inception_5b/5x5_left"
  bottom: "inception_5b/pool_proj_left"
  top: "inception_5b/output_left"
}
layer {
  name: "pool5/7x7_s1_left"
  type: "Pooling"
  bottom: "inception_5b/output_left"
  top: "pool5/7x7_s1_left"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
#####################################################################################################
# Build the right part of the Siamese Network:
layer {
  name: "conv1/7x7_s2_right"
  type: "Convolution"
  bottom: "data_right"
  top: "conv1/7x7_s2_right"
  param {
    name: "conv1/7x7_s2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1/7x7_s2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1/relu_7x7_right"
  type: "ReLU"
  bottom: "conv1/7x7_s2_right"
  top: "conv1/7x7_s2_right"
}
layer {
  name: "pool1/3x3_s2_right"
  type: "Pooling"
  bottom: "conv1/7x7_s2_right"
  top: "pool1/3x3_s2_right"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1/norm1_right"
  type: "LRN"
  bottom: "pool1/3x3_s2_right"
  top: "pool1/norm1_right"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2/3x3_reduce_right"
  type: "Convolution"
  bottom: "pool1/norm1_right"
  top: "conv2/3x3_reduce_right"
  param {
    name: "conv2/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_reduce_right"
  type: "ReLU"
  bottom: "conv2/3x3_reduce_right"
  top: "conv2/3x3_reduce_right"
}
layer {
  name: "conv2/3x3_right"
  type: "Convolution"
  bottom: "conv2/3x3_reduce_right"
  top: "conv2/3x3_right"
  param {
    name: "conv2/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_right"
  type: "ReLU"
  bottom: "conv2/3x3_right"
  top: "conv2/3x3_right"
}
layer {
  name: "conv2/norm2_right"
  type: "LRN"
  bottom: "conv2/3x3_right"
  top: "conv2/norm2_right"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2/3x3_s2_right"
  type: "Pooling"
  bottom: "conv2/norm2_right"
  top: "pool2/3x3_s2_right"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a/1x1_right"
  type: "Convolution"
  bottom: "pool2/3x3_s2_right"
  top: "inception_3a/1x1_right"
  param {
    name: "inception_3a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1_right"
  type: "ReLU"
  bottom: "inception_3a/1x1_right"
  top: "inception_3a/1x1_right"
}
layer {
  name: "inception_3a/3x3_reduce_right"
  type: "Convolution"
  bottom: "pool2/3x3_s2_right"
  top: "inception_3a/3x3_reduce_right"
  param {
    name: "inception_3a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce_right"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce_right"
  top: "inception_3a/3x3_reduce_right"
}
layer {
  name: "inception_3a/3x3_right"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_right"
  top: "inception_3a/3x3_right"
  param {
    name: "inception_3a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_right"
  type: "ReLU"
  bottom: "inception_3a/3x3_right"
  top: "inception_3a/3x3_right"
}
layer {
  name: "inception_3a/5x5_reduce_right"
  type: "Convolution"
  bottom: "pool2/3x3_s2_right"
  top: "inception_3a/5x5_reduce_right"
  param {
    name: "inception_3a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce_right"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce_right"
  top: "inception_3a/5x5_reduce_right"
}
layer {
  name: "inception_3a/5x5_right"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce_right"
  top: "inception_3a/5x5_right"
  param {
    name: "inception_3a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
